# How do I read a tabular data file into pandas?

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

<h6>Panda's read_table method needs a tab seperated file</h6>

In [2]:
orders = pd.read_table("http://bit.ly/chiporders")

In [3]:
orders.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

We can tell read_table to use another seperator instead of "tab" by using the **sep** argument. Also we can use **header** argument to specify if the the file doesn't have one. To use custom column names, we can use the **names** argument

In [4]:
user_cols = ["user_id", "age", "gender", "occupation", "zip_code"]

users = pd.read_table("http://bit.ly/movieusers", sep="|", header=None, names=user_cols)

In [5]:
users.head(5)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# How do I select Series from a DataFrame?

DataFrames and Series are the two main object types in pandas for data storage: a DataFrame is like a table, and each column of the table is called a Series. You will often select a Series in order to analyze or manipulate it. In this video, I'll show you how to select a Series using "bracket notation" and "dot notation", and will discuss the limitations of dot notation.<br>
    I'll also demonstrate how to create a new Series in a DataFrame.

In [6]:
ufo = pd.read_csv('http://bit.ly/uforeports')

type(ufo)

pandas.core.frame.DataFrame

In [7]:
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [8]:
ufo['City'].head(10)

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
6             Crater Lake
7                    Alma
8                 Eklutna
9                 Hubbard
Name: City, dtype: object

In [9]:
type(ufo['City'])  # ufo.City

pandas.core.series.Series

# Why do some some pandas commands paretheses, and other commands don't?

In [10]:
movies = pd.read_csv("http://bit.ly/imdbratings")

In [11]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [12]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [13]:
movies.shape

(979, 6)

In [14]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

# How do I rename columns in a pandas DataFrame?

In [15]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [16]:
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [18]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

**Renaming columns in Pandas DataFrame**

In [22]:
ufo.rename(columns = {'Colors Reported': 'ColorsReported', 'Shape Reported': 'ShapeReported'}, inplace=True)

ufo.columns

Index(['City', 'ColorsReported', 'ShapeReported', 'State', 'Time'], dtype='object')

**Renaming all columns in Pandas DataFrame**

In [23]:
ufo_cols = ['city', 'colorsreported', 'shapereported', 'state', 'time']

ufo.columns = ufo_cols

ufo.head(5)

                   city colorsreported shapereported state             time
0                Ithaca            NaN      TRIANGLE    NY   6/1/1930 22:00
1           Willingboro            NaN         OTHER    NJ  6/30/1930 20:00
2               Holyoke            NaN          OVAL    CO  2/15/1931 14:00
3               Abilene            NaN          DISK    KS   6/1/1931 13:00
4  New York Worlds Fair            NaN         LIGHT    NY  4/18/1933 19:00

**Reading the CSV or TSV with custom column names**

We can use __**names**__ and __**header**__ arguments in the read_csv and read_tsv methods to read CSVs and TSVs with custom column names.
<br>
The **header** argument mentions which row of the CSV/TSV file contains the column names.
<br>
The **names** argument contains the actual custom column names for the new DataFrame

In [26]:
ufo = pd.read_csv("http://bit.ly/uforeports", names=ufo_cols, header=0)

ufo.head(5)

                   city colorsreported shapereported state             time
0                Ithaca            NaN      TRIANGLE    NY   6/1/1930 22:00
1           Willingboro            NaN         OTHER    NJ  6/30/1930 20:00
2               Holyoke            NaN          OVAL    CO  2/15/1931 14:00
3               Abilene            NaN          DISK    KS   6/1/1931 13:00
4  New York Worlds Fair            NaN         LIGHT    NY  4/18/1933 19:00

**How to replace all spaces in column name with a underscore**

In [27]:
ufo = pd.read_csv("http://bit.ly/uforeports")


ufo.columns = ufo.columns.str.replace(' ', '_')

ufo.head(10)

                   City Colors_Reported Shape_Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

# How do I remove columns from a pandas DataFrame?

In [28]:
ufo = pd.read_csv("http://bit.ly/uforeports")

ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [29]:
ufo.shape

(18241, 5)

In [30]:
ufo.drop("Colors Reported", axis=1, inplace=True)  # Axis is kindof column axis

ufo.head(5)

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

**Removing multiple columns at once**

In [31]:
ufo.drop(["City", "State"], axis=1, inplace=True)

ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

**Dropping rows**

In [34]:
ufo.drop([0, 1], axis=0, inplace=True)

In [35]:
ufo.head(5)

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00